{
  "P3MS_subj12to4_seed0": {
    "protocol": "P3MS",
    "seed": 0,
    "snapshot_date": "2026-02-26",
    "split_id": "P3MS_subj12to4_seed0",
    "split_npz": "/mnt/share_gpu/naokkimu/epg_speller_for_icassp_camera_ready/raw_dataset/protocolSxms_split_seed0_subj12to4_ds1.npz",
    "subject": "subj12to4",
    "vocab": {
      "competition": [
        "ATE",
        "AWAY",
        "BARRACKS",
        "BLOCKED",
        "BURGLARS",
        "COME",
        "CONSTRUCTION",
        "COURTS",
        "CREAM",
        "CUSTODY",
        "DECISIONS",
        "EFFORT",
        "ENTER",
        "EXPERIENCE",
        "FACE",
        "FALL",
        "FAVOURITE",
        "FILE",
        "HEROIC",
        "LOST",
        "MAKES",
        "MICE",
        "MONTH",
        "MORTGAGE",
        "MUSIC",
        "NOON",
        "NOTE",
        "NOW",
        "OPPOSING",
        "PANEL",
        "PIZZA",
        "PRESIDENTIAL",
        "PRESIDENTS",
        "PROPOSAL",
        "QUARTER",
        "QUESTIONING",
        "QUICK",
        "RIDICULOUS",
        "RIDING",
        "RISEN",
        "SEE",
        "SHARP",
        "SIGN",
        "SLIP",
        "STRIKE",
        "SUCH",
        "TEN",
        "TREASURER",
        "WAS",
        "YES"
      ],
      "test": [
        "A",
        "ABANDONED",
        "ABOARD",
        "ABOUT",
        "ACCEPT",
        "ACCEPTANCE",
        "ACCIDENT",
        "ACCOMPANIED",
        "ACCORDING",
        "ACCOUNT",
        "ACUTELY",
        "ADDITION",
        "ADULT",
        "ADVANCE",
        "AFRAID",
        "AFTER",
        "AGAIN",
        "AGES",
        "AGREE",
        "AGREEMENT",
        "AHEAD",
        "AIRPORT",
        "ALGORITHM",
        "ALL",
        "ALLERGIC",
        "ALLIGATOR",
        "ALLOTTED",
        "ALMOST",
        "ALWAYS",
        "AM",
        "AMAZING",
        "AMOUNT",
        "AN",
        "AND",
        "ANIMAL",
        "ANNIVERSARY",
        "ANNOUNCE",
        "ANSWERED",
        "ANY",
        "ANYMORE",
        "ANYTHING",
        "APARTMENTS",
        "APPEARS",
        "APPLE",
        "APPOINTMENT",
        "ARE",
        "ARGUING",
        "AROUND",
        "AS",
        "ASK",
        "ASKED",
        "ASPIRATIONS",
        "ASSAULT",
        "ASSIGNMENT",
        "ASTONISHMENT",
        "AT",
        "ATE",
        "ATHLETES",
        "AVOIDED",
        "AWARE",
        "AWAY",
        "BACK",
        "BAD",
        "BAKING",
        "BALANCE",
        "BALL",
        "BALONEY",
        "BANK",
        "BARE",
        "BAROQUE",
        "BARRACKS",
        "BASES",
        "BATH",
        "BATHROOM",
        "BATMAN",
        "BATTLES",
        "BE",
        "BEARS",
        "BEAUTIFUL",
        "BEEN",
        "BEER",
        "BEES",
        "BEFORE",
        "BEGINNING",
        "BEHIND",
        "BELIEVE",
        "BENIGN",
        "BEST",
        "BETTER",
        "BETWEEN",
        "BEWARE",
        "BIG",
        "BIGGEST",
        "BIKE",
        "BILL",
        "BILLS",
        "BIRD",
        "BIRTH",
        "BIRTHDAY",
        "BITE",
        "BITES",
        "BLAST",
        "BLAZED",
        "BLAZING",
        "BLOCKED",
        "BLOODSHED",
        "BLOW",
        "BLUES",
        "BONE",
        "BOOKS",
        "BORING",
        "BORROWER",
        "BOSS",
        "BOYS",
        "BREAK",
        "BREAKS",
        "BREATHING",
        "BRING",
        "BROKE",
        "BROKEN",
        "BROWN",
        "BROWSER",
        "BUCKLE",
        "BULLET",
        "BURGLARS",
        "BURIED",
        "BUS",
        "BUSINESS",
        "BUSY",
        "BUT",
        "BY",
        "BYPASS",
        "CAKE",
        "CALL",
        "CALLED",
        "CAMERA",
        "CAMPING",
        "CAN",
        "CANADA",
        "CANCER",
        "CANNOT",
        "CAPE",
        "CAPITAL",
        "CAPITALIST",
        "CAR",
        "CARD",
        "CARDS",
        "CARE",
        "CARELESS",
        "CARES",
        "CARPET",
        "CARS",
        "CAT",
        "CELLS",
        "CENTURY",
        "CHALLENGED",
        "CHAMBER",
        "CHANCELLOR",
        "CHANGED",
        "CHECKS",
        "CHEESE",
        "CHEMICAL",
        "CHEMISTRY",
        "CHEVY",
        "CHILD",
        "CHILDREN",
        "CHILLS",
        "CHLORINE",
        "CHOCOLATE",
        "CIRCUMSTANCES",
        "CITY",
        "CLASSICAL",
        "CLAUS",
        "CLOSE",
        "CLOSED",
        "COALITION",
        "COFFEE",
        "COLD",
        "COLLAPSE",
        "COME",
        "COMING",
        "COMMENT",
        "COMMITTED",
        "COMMUNICATE",
        "COMPANIES",
        "COMPLAINTS",
        "COMPLETE",
        "COMPLETELY",
        "COMPLICATED",
        "CONCENTRATE",
        "CONFERENCES",
        "CONFIDENTIAL",
        "CONNECTED",
        "CONSCIENCE",
        "CONSEQUENCES",
        "CONSIDERATION",
        "CONSTRUCTION",
        "CONTEST",
        "CONTRAST",
        "COOKIES",
        "COOLED",
        "CORONATION",
        "CORRECT",
        "CORRECTION",
        "COTTAGE",
        "COTTON",
        "COUNTRY",
        "COUPON",
        "COURSE",
        "COURT",
        "COURTS",
        "COVER",
        "CREAM",
        "CRIME",
        "CROWDED",
        "CROWN",
        "CUPS",
        "CURVE",
        "CUSTODY",
        "CUT",
        "DAILY",
        "DARING",
        "DASHING",
        "DATE",
        "DAUGHTERS",
        "DAY",
        "DECISION",
        "DECISIONS",
        "DEED",
        "DELIVERY",
        "DENIAL",
        "DEPARTMENT",
        "DEPOT",
        "DESERVE",
        "DESERVES",
        "DESIRED",
        "DESTRUCTION",
        "DETAILS",
        "DETECTOR",
        "DEWDROP",
        "DICTION",
        "DID",
        "DIFFICULT",
        "DINE",
        "DINOSAURS",
        "DIPLOMACY",
        "DIPPED",
        "DIRECTION",
        "DISASTER",
        "DISCHARGED",
        "DISCOURAGING",
        "DISCOVERING",
        "DISCREET",
        "DISGUSTING",
        "DISTURBANCE",
        "DO",
        "DOCTOR",
        "DOES",
        "DOG",
        "DOLPHINS",
        "DOOR",
        "DOORS",
        "DORMITORY",
        "DOUBLE",
        "DOW",
        "DOWN",
        "DREAM",
        "DREAMERS",
        "DREAMS",
        "DRESS",
        "DRINK",
        "DRIVE",
        "DRIVERS",
        "DRIVEWAYS",
        "DRIVING",
        "DROVE",
        "DRUGS",
        "DRY",
        "DUCK",
        "DUE",
        "EACH",
        "EARLY",
        "EARTH",
        "EAST",
        "EASY",
        "EAT",
        "ECONOMY",
        "EDITION",
        "EDUCATION",
        "EFFORT",
        "EFFORTS",
        "EGO",
        "EIGHT",
        "ELECTIONS",
        "ELECTRIC",
        "ELECTRICAL",
        "ELEPHANTS",
        "ELEVATOR",
        "ELSE",
        "EMAIL",
        "EMPIRE",
        "EMPLOYEE",
        "ENCOURAGEMENT",
        "END",
        "ENGINE",
        "ENJOY",
        "ENLARGED",
        "ENOUGH",
        "ENTER",
        "ENTIRE",
        "ENVIRONMENT",
        "EQUATION",
        "ETIQUETTE",
        "EVENING",
        "EVENTUALLY",
        "EVER",
        "EVERY",
        "EVERYBODY",
        "EVERYDAY",
        "EVERYONE",
        "EVERYWHERE",
        "EXAM",
        "EXAMPLE",
        "EXASPERATION",
        "EXCEED",
        "EXCELLENT",
        "EXCHANGE",
        "EXCITED",
        "EXCITING",
        "EXERCISE",
        "EXPECTANCY",
        "EXPENSES",
        "EXPENSIVE",
        "EXPERIENCE",
        "EXPLOSION",
        "EXPRESS",
        "EXTINCT",
        "EXTRA",
        "FACE",
        "FACTS",
        "FAILURE",
        "FALL",
        "FALLING",
        "FANS",
        "FAST",
        "FASTER",
        "FAVORITE",
        "FAVOURITE",
        "FAX",
        "FEBRUARY",
        "FEEL",
        "FEELING",
        "FELL",
        "FEW",
        "FIELD",
        "FIGURE",
        "FILE",
        "FIND",
        "FINE",
        "FINER",
        "FINGERS",
        "FIRE",
        "FIRST",
        "FISH",
        "FIT",
        "FIVE",
        "FLASHING",
        "FLAT",
        "FLAVORED",
        "FLYING",
        "FOG",
        "FOLDS",
        "FOLLOW",
        "FOOD",
        "FOOTBALL",
        "FOR",
        "FORCE",
        "FOREST",
        "FOREVER",
        "FORWARD",
        "FOUND",
        "FOUR",
        "FOURTH",
        "FOX",
        "FREE",
        "FREQUENTLY",
        "FREUD",
        "FRIEND",
        "FRIENDLY",
        "FROM",
        "FRONT",
        "FUDGE",
        "FUEL",
        "FULL",
        "FULLY",
        "FUN",
        "FUTILE",
        "GALLERY",
        "GAMBLERS",
        "GAME",
        "GAP",
        "GARBAGE",
        "GAS",
        "GEL",
        "GENERATION",
        "GET",
        "GETS",
        "GETTING",
        "GIVE",
        "GIVES",
        "GLANCE",
        "GLASSES",
        "GO",
        "GOES",
        "GOING",
        "GOLDILOCKS",
        "GOLFERS",
        "GOOD",
        "GOSPEL",
        "GOT",
        "GOVERNMENT",
        "GOVERNMENTS",
        "GRANITE",
        "GREASY",
        "GREAT",
        "GROCERY",
        "GROW",
        "GROWING",
        "GUIDELINES",
        "GUN",
        "HAD",
        "HAIR",
        "HAMBURGER",
        "HAND",
        "HANDICAPPED",
        "HANDLE",
        "HANDLED",
        "HANDS",
        "HARD",
        "HARDEST",
        "HAS",
        "HATE",
        "HAVE",
        "HAVING",
        "HE",
        "HEAD",
        "HEALTHY",
        "HEAR",
        "HEAT",
        "HECK",
        "HELP",
        "HELPS",
        "HER",
        "HERE",
        "HEROIC",
        "HIGH",
        "HIGHER",
        "HIGHWAY",
        "HIM",
        "HIS",
        "HISTORIC",
        "HOLD",
        "HOLE",
        "HOME",
        "HONEST",
        "HOPES",
        "HORN",
        "HOUR",
        "HOURS",
        "HOUSE",
        "HOUSEKEEPER",
        "HOW",
        "I",
        "ICE",
        "IDEA",
        "IDES",
        "IDIOT",
        "IF",
        "IMAGINATION",
        "IMMEDIATELY",
        "IMPORTANT",
        "IN",
        "INCREASED",
        "INDEX",
        "INDICATION",
        "INEFFICIENT",
        "INFORMATION",
        "INJUSTICE",
        "INSPIRING",
        "INSULATION",
        "INSURANCE",
        "INTERACTIONS",
        "INTERESTING",
        "INTERFACE",
        "INVESTIGATE",
        "IRREGULAR",
        "IS",
        "IT",
        "JACKET",
        "JAMMED",
        "JEDI",
        "JEWELS",
        "JOB",
        "JOBS",
        "JOIN",
        "JOKE",
        "JONES",
        "JUDGES",
        "JUMPED",
        "JUMPING",
        "JUST",
        "JUSTICE",
        "KEEP",
        "KEEPS",
        "KIDS",
        "KILLER",
        "KING",
        "KISSING",
        "KNEE",
        "KNEES",
        "KNOCKING",
        "KNOW",
        "LABOUR",
        "LAGOON",
        "LAMB",
        "LAND",
        "LARGEST",
        "LASER",
        "LAST",
        "LATE",
        "LATER",
        "LAUGH",
        "LAUNDRY",
        "LAVATORY",
        "LEAP",
        "LEARN",
        "LEARNING",
        "LEATHER",
        "LEAVE",
        "LEAVING",
        "LEFT",
        "LENDER",
        "LENS",
        "LESSON",
        "LETTERS",
        "LEVEE",
        "LIAR",
        "LIBRARY",
        "LIE",
        "LIFE",
        "LIGHT",
        "LIKE",
        "LIMIT",
        "LIMITED",
        "LINE",
        "LISTEN",
        "LITTLE",
        "LIVING",
        "LOCATION",
        "LOCKED",
        "LONG",
        "LONGER",
        "LOOK",
        "LOOKS",
        "LOOSE",
        "LOOSES",
        "LOSERS",
        "LOST",
        "LOT",
        "LOTTERY",
        "LOUDLY",
        "LOVE",
        "LOVELY",
        "LOW",
        "LUCKILY",
        "LUNCH",
        "LYDIA",
        "MACHINE",
        "MACHINERY",
        "MADE",
        "MAIL",
        "MAJESTY",
        "MAKE",
        "MAKES",
        "MAKEUP",
        "MAN",
        "MANY",
        "MARCH",
        "MARY",
        "MASK",
        "MATERNITY",
        "MAXIMUM",
        "ME",
        "MEANS",
        "MEDIEVAL",
        "MEET",
        "MEETING",
        "MEN",
        "MERGER",
        "MET",
        "METER",
        "MICE",
        "MICROSCOPES",
        "MIDNIGHT",
        "MIGHT",
        "MIGHTIER",
        "MIND",
        "MINE",
        "MINIMUM",
        "MINUTE",
        "MISSED",
        "MISSION",
        "MIX",
        "MODERATION",
        "MOM",
        "MONITORED",
        "MONKEY",
        "MONTH",
        "MONTHLY",
        "MONTHS",
        "MORE",
        "MORTGAGE",
        "MOST",
        "MOTHER",
        "MOTIVATIONAL",
        "MOVIE",
        "MUCH",
        "MURDER",
        "MUSIC",
        "MUST",
        "MY",
        "MYSTERY",
        "NASTY",
        "NATION",
        "NATIONS",
        "NEAR",
        "NEARBY",
        "NEED",
        "NEEDED",
        "NEEDS",
        "NEITHER",
        "NERVOUS",
        "NEVER",
        "NEW",
        "NEWS",
        "NICE",
        "NIGHT",
        "NO",
        "NOBODY",
        "NON",
        "NOON",
        "NOR",
        "NOSE",
        "NOT",
        "NOTE",
        "NOTHING",
        "NOW",
        "NUMBER",
        "NUTTY",
        "OBEY",
        "OBJECTIVE",
        "OBJECTS",
        "OBLIGATIONS",
        "OBSERVATION",
        "OCCASIONAL",
        "OCCUR",
        "OCEANS",
        "OF",
        "OFF",
        "OFFENDERS",
        "OFFENDS",
        "OFFENSIVE",
        "OFFER",
        "OIL",
        "OK",
        "OLD",
        "OLYMPIC",
        "ON",
        "ONE",
        "ONLY",
        "OPERA",
        "OPPOSING",
        "OR",
        "ORDER",
        "ORDERED",
        "ORGANIZATION",
        "ORGANIZE",
        "OUR",
        "OUT",
        "OVER",
        "OVERDRAWN",
        "OWNED",
        "PAID",
        "PAINTINGS",
        "PANEL",
        "PARK",
        "PARKING",
        "PARKWAYS",
        "PARTIES",
        "PARTS",
        "PARTY",
        "PATIO",
        "PAY",
        "PEANUTS",
        "PEEK",
        "PEERING",
        "PEN",
        "PENALTY",
        "PEOPLE",
        "PERIOD",
        "PERSISTENT",
        "PERSON",
        "PERSONAL",
        "PERSONS",
        "PHENOMENON",
        "PHOTOGRAPHS",
        "PHRASES",
        "PHYSICS",
        "PICKET",
        "PICTURE",
        "PIES",
        "PIG",
        "PILE",
        "PIMP",
        "PIZZA",
        "PLACE",
        "PLAY",
        "PLAYED",
        "PLAYERS",
        "PLAYING",
        "PLEASANT",
        "PLEASE",
        "PLUG",
        "POISONOUS",
        "POLITICAL",
        "POLITICS",
        "POOREST",
        "POPULARITY",
        "POPULATION",
        "POSTAL",
        "POWDER",
        "POWER",
        "PRAYER",
        "PRECAUTIONS",
        "PREDICTABLE",
        "PREFER",
        "PREFERRED",
        "PREPARE",
        "PRESCRIPTION",
        "PRESENCE",
        "PRESENTATION",
        "PRESIDENTIAL",
        "PRESIDENTS",
        "PREVAILING",
        "PRICE",
        "PRINTER",
        "PRIORITIES",
        "PRIORITY",
        "PRISON",
        "PRIZE",
        "PROBLEM",
        "PROBLEMS",
        "PROFESSOR",
        "PROFIT",
        "PROPOSAL",
        "PROPRIETOR",
        "PROTECT",
        "PROTESTERS",
        "PROVIDE",
        "PROVIDED",
        "PROVINCES",
        "PSYCHIATRIST",
        "PSYCHOLOGY",
        "PUBLIC",
        "PUBLISHED",
        "PUMPING",
        "PUNISHMENT",
        "PUT",
        "QUACKS",
        "QUAKES",
        "QUARTER",
        "QUESTION",
        "QUESTIONING",
        "QUESTIONS",
        "QUICK",
        "QUICKLY",
        "QUIT",
        "QUITE",
        "QUOTA",
        "RACE",
        "RACKETBALL",
        "RAGED",
        "RAIN",
        "RAINDROPS",
        "RAISE",
        "RAPIDLY",
        "RATIONALE",
        "RATTLE",
        "REACH",
        "READING",
        "REALLY",
        "RECEIPTS",
        "RECRUITMENT",
        "RECTANGULAR",
        "RECYCLING",
        "RED",
        "REDOUBLE",
        "REDRESS",
        "REFERENDUM",
        "REFUSE",
        "REGISTERED",
        "REGISTRATION",
        "REJECTION",
        "RELATIONS",
        "RELIGION",
        "RELUCTANT",
        "RENT",
        "REQUIRE",
        "REQUIRES",
        "RESPONSE",
        "RESTAURANT",
        "RESULT",
        "RESULTS",
        "RETURN",
        "RICH",
        "RID",
        "RIDICULOUS",
        "RIDING",
        "RIFE",
        "RIGHT",
        "RINGS",
        "RISEN",
        "RISES",
        "RISK",
        "ROADS",
        "ROBIN",
        "ROCKS",
        "ROMAN",
        "ROUND",
        "ROVER",
        "RULES",
        "RUN",
        "RUNNING",
        "RUNS",
        "SAD",
        "SADDLES",
        "SAFE",
        "SAFETY",
        "SALESMEN",
        "SAM",
        "SAMPLE",
        "SANTA",
        "SATURDAY",
        "SATURN",
        "SAVING",
        "SAY",
        "SAYS",
        "SCENE",
        "SCHEDULING",
        "SCHOOLS",
        "SCRATCH",
        "SEASON",
        "SEASONED",
        "SEASONS",
        "SEAT",
        "SECOND",
        "SECURITY",
        "SEE",
        "SEEMS",
        "SEEN",
        "SEES",
        "SEMINARS",
        "SENDS",
        "SENT",
        "SENTENCE",
        "SERVICE",
        "SERVICES",
        "SEVEN",
        "SHACK",
        "SHALL",
        "SHARP",
        "SHE",
        "SHEDS",
        "SHIP",
        "SHIRTS",
        "SHIVERING",
        "SHOP",
        "SHOPPING",
        "SHORT",
        "SHOULD",
        "SHOULDERS",
        "SHOUTING",
        "SHRINE",
        "SICK",
        "SIDES",
        "SIGN",
        "SILLY",
        "SILVER",
        "SING",
        "SISTER",
        "SIT",
        "SIX",
        "SIZE",
        "SKATE",
        "SKIMMED",
        "SLIP",
        "SLIPPERY",
        "SLOW",
        "SMALL",
        "SMART",
        "SNAKE",
        "SNOW",
        "SO",
        "SOCKET",
        "SOLD",
        "SOME",
        "SOMEONE",
        "SONS",
        "SOON",
        "SOUND",
        "SOUNDS",
        "SPACE",
        "SPAGHETTI",
        "SPEAK",
        "SPECTACULAR",
        "SPEECH",
        "SPEED",
        "SPEEDING",
        "SPILL",
        "SPILLED",
        "SPOONFUL",
        "SPORT",
        "SPOT",
        "SPRAWLING",
        "SQUANDER",
        "STABILITY",
        "STAGE",
        "STARLIGHT",
        "STATEMENT",
        "STAY",
        "STAYING",
        "STEEP",
        "STEP",
        "STICKER",
        "STIFF",
        "STILL",
        "STIMULUS",
        "STOCK",
        "STOP",
        "STORE",
        "STRAINED",
        "STRANGERS",
        "STREETS",
        "STRIKE",
        "STUCK",
        "STUPID",
        "STYLE",
        "SUBDIVISIONS",
        "SUBJECT",
        "SUBJECTS",
        "SUBTRACTION",
        "SUBURBS",
        "SUCCEED",
        "SUCH",
        "SUCKER",
        "SUGGESTS",
        "SUITE",
        "SUM",
        "SUMMIT",
        "SUN",
        "SUNDAY",
        "SUNNY",
        "SUNSET",
        "SUPER",
        "SUPERMAN",
        "SURE",
        "SURGERY",
        "SWAMP",
        "SWEATSHIRT",
        "SWIM",
        "SWORD",
        "SYLLABUS",
        "SYMPATHY",
        "SYSTEM",
        "TABLETOP",
        "TAKE",
        "TAKES",
        "TAKING",
        "TALKING",
        "TAPE",
        "TASTE",
        "TAXATION",
        "TEACHING",
        "TEAM",
        "TELL",
        "TEMPERAMENT",
        "TEN",
        "TENNIS",
        "TESTS",
        "THAN",
        "THANK",
        "THAT",
        "THE",
        "THEIR",
        "THERE",
        "THESE",
        "THEY",
        "THIGH",
        "THIN",
        "THING",
        "THINGS",
        "THINK",
        "THINKING",
        "THIS",
        "THOROUGH",
        "THOROUGHLY",
        "THOSE",
        "THOUSAND",
        "THREE",
        "THROUGH",
        "TICKETS",
        "TIE",
        "TIME",
        "TIMES",
        "TIRE",
        "TO",
        "TODAY",
        "TOES",
        "TOGETHER",
        "TOIL",
        "TOMORROW",
        "TONIGHT",
        "TOO",
        "TOOK",
        "TOP",
        "TOSS",
        "TOUCHDOWN",
        "TOWER",
        "TRADITIONAL",
        "TRAFFIC",
        "TRAIN",
        "TRAINS",
        "TRANSACTION",
        "TRANSIT",
        "TRAVEL",
        "TRAVELING",
        "TREASURE",
        "TREASURER",
        "TREASURY",
        "TREAT",
        "TREE",
        "TRIED",
        "TRIPLE",
        "TROUBLE",
        "TRUCKS",
        "TRY",
        "TUMOR",
        "TURFED",
        "TURN",
        "TURTLENECK",
        "TWO",
        "UNACCEPTABLE",
        "UNAVAILABLE",
        "UNDERSTOOD",
        "UNDERWENT",
        "UNFORTUNATE",
        "UNICYCLE",
        "UNION",
        "UNIONS",
        "UNIVERSALLY",
        "UNIVERSITIES",
        "UNTIL",
        "US",
        "USE",
        "USER",
        "USUALLY",
        "VALID",
        "VALIDATED",
        "VALIUM",
        "VANILLA",
        "VENTILATION",
        "VERBS",
        "VERY",
        "VICTIMS",
        "VIDEO",
        "VISIT",
        "VISITED",
        "VOICE",
        "VOTE",
        "VOTERS",
        "WALK",
        "WALLET",
        "WANT",
        "WANTS",
        "WAR",
        "WARM",
        "WARRANTY",
        "WAS",
        "WATCH",
        "WATCHED",
        "WATER",
        "WAVES",
        "WAY",
        "WE",
        "WEAR",
        "WEARING",
        "WEARS",
        "WEB",
        "WEEK",
        "WEEKEND",
        "WEEKENDS",
        "WEEPING",
        "WELL",
        "WENT",
        "WERE",
        "WHAT",
        "WHEN",
        "WHERE",
        "WHILE",
        "WHOLE",
        "WHY",
        "WIDER",
        "WILL",
        "WILLOWS",
        "WIN",
        "WIND",
        "WINDOW",
        "WINDY",
        "WINNER",
        "WINNERS",
        "WINTER",
        "WISDOM",
        "WISHFUL",
        "WITH",
        "WITHDRAWAL",
        "WITHOUT",
        "WITNESSES",
        "WOMEN",
        "WONDERFUL",
        "WORDS",
        "WORE",
        "WORK",
        "WORKING",
        "WORLD",
        "WORM",
        "WORRY",
        "WORTH",
        "WOULD",
        "WRITING",
        "WRONG",
        "WROTE",
        "YAP",
        "YARD",
        "YEAR",
        "YEARS",
        "YES",
        "YET",
        "YOU",
        "YOUNG",
        "YOUR",
        "ZERO",
        "ZOOM"
      ],
      "train": [
        "A",
        "ABANDONED",
        "ABOARD",
        "ABOUT",
        "ACCEPT",
        "ACCEPTANCE",
        "ACCIDENT",
        "ACCOMPANIED",
        "ACCORDING",
        "ACCOUNT",
        "ACUTELY",
        "ADDITION",
        "ADULT",
        "ADVANCE",
        "AFRAID",
        "AFTER",
        "AGAIN",
        "AGES",
        "AGREE",
        "AGREEMENT",
        "AHEAD",
        "AIRPORT",
        "ALGORITHM",
        "ALL",
        "ALLERGIC",
        "ALLIGATOR",
        "ALLOTTED",
        "ALMOST",
        "ALWAYS",
        "AM",
        "AMAZING",
        "AMOUNT",
        "AN",
        "AND",
        "ANIMAL",
        "ANNIVERSARY",
        "ANNOUNCE",
        "ANSWERED",
        "ANY",
        "ANYMORE",
        "ANYTHING",
        "APARTMENTS",
        "APPEARS",
        "APPLE",
        "APPOINTMENT",
        "ARE",
        "ARGUING",
        "AROUND",
        "AS",
        "ASK",
        "ASKED",
        "ASPIRATIONS",
        "ASSAULT",
        "ASSIGNMENT",
        "ASTONISHMENT",
        "AT",
        "ATHLETES",
        "AVOIDED",
        "AWARE",
        "BACK",
        "BAD",
        "BAKING",
        "BALANCE",
        "BALL",
        "BALONEY",
        "BANK",
        "BARE",
        "BAROQUE",
        "BASES",
        "BATH",
        "BATHROOM",
        "BATMAN",
        "BATTLES",
        "BE",
        "BEARS",
        "BEAUTIFUL",
        "BEEN",
        "BEER",
        "BEES",
        "BEFORE",
        "BEGINNING",
        "BEHIND",
        "BELIEVE",
        "BENIGN",
        "BEST",
        "BETTER",
        "BETWEEN",
        "BEWARE",
        "BIG",
        "BIGGEST",
        "BIKE",
        "BILL",
        "BILLS",
        "BIRD",
        "BIRTH",
        "BIRTHDAY",
        "BITE",
        "BITES",
        "BLAST",
        "BLAZED",
        "BLAZING",
        "BLOODSHED",
        "BLOW",
        "BLUES",
        "BONE",
        "BOOKS",
        "BORING",
        "BORROWER",
        "BOSS",
        "BOYS",
        "BREAK",
        "BREAKS",
        "BREATHING",
        "BRING",
        "BROKE",
        "BROKEN",
        "BROWN",
        "BROWSER",
        "BUCKLE",
        "BULLET",
        "BURIED",
        "BUS",
        "BUSINESS",
        "BUSY",
        "BUT",
        "BY",
        "BYPASS",
        "CAKE",
        "CALL",
        "CALLED",
        "CAMERA",
        "CAMPING",
        "CAN",
        "CANADA",
        "CANCER",
        "CANNOT",
        "CAPE",
        "CAPITAL",
        "CAPITALIST",
        "CAR",
        "CARD",
        "CARDS",
        "CARE",
        "CARELESS",
        "CARES",
        "CARPET",
        "CARS",
        "CAT",
        "CELLS",
        "CENTURY",
        "CHALLENGED",
        "CHAMBER",
        "CHANCELLOR",
        "CHANGED",
        "CHECKS",
        "CHEESE",
        "CHEMICAL",
        "CHEMISTRY",
        "CHEVY",
        "CHILD",
        "CHILDREN",
        "CHILLS",
        "CHLORINE",
        "CHOCOLATE",
        "CIRCUMSTANCES",
        "CITY",
        "CLASSICAL",
        "CLAUS",
        "CLOSE",
        "CLOSED",
        "COALITION",
        "COFFEE",
        "COLD",
        "COLLAPSE",
        "COMING",
        "COMMENT",
        "COMMITTED",
        "COMMUNICATE",
        "COMPANIES",
        "COMPLAINTS",
        "COMPLETE",
        "COMPLETELY",
        "COMPLICATED",
        "CONCENTRATE",
        "CONFERENCES",
        "CONFIDENTIAL",
        "CONNECTED",
        "CONSCIENCE",
        "CONSEQUENCES",
        "CONSIDERATION",
        "CONTEST",
        "CONTRAST",
        "COOKIES",
        "COOLED",
        "CORONATION",
        "CORRECT",
        "CORRECTION",
        "COTTAGE",
        "COTTON",
        "COUNTRY",
        "COUPON",
        "COURSE",
        "COURT",
        "COVER",
        "CRIME",
        "CROWDED",
        "CROWN",
        "CUPS",
        "CURVE",
        "CUT",
        "DAILY",
        "DARING",
        "DASHING",
        "DATE",
        "DAUGHTERS",
        "DAY",
        "DECISION",
        "DEED",
        "DELIVERY",
        "DENIAL",
        "DEPARTMENT",
        "DEPOT",
        "DESERVE",
        "DESERVES",
        "DESIRED",
        "DESTRUCTION",
        "DETAILS",
        "DETECTOR",
        "DEWDROP",
        "DICTION",
        "DID",
        "DIFFICULT",
        "DINE",
        "DINOSAURS",
        "DIPLOMACY",
        "DIPPED",
        "DIRECTION",
        "DISASTER",
        "DISCHARGED",
        "DISCOURAGING",
        "DISCOVERING",
        "DISCREET",
        "DISGUSTING",
        "DISTURBANCE",
        "DO",
        "DOCTOR",
        "DOES",
        "DOG",
        "DOLPHINS",
        "DOOR",
        "DOORS",
        "DORMITORY",
        "DOUBLE",
        "DOW",
        "DOWN",
        "DREAM",
        "DREAMERS",
        "DREAMS",
        "DRESS",
        "DRINK",
        "DRIVE",
        "DRIVERS",
        "DRIVEWAYS",
        "DRIVING",
        "DROVE",
        "DRUGS",
        "DRY",
        "DUCK",
        "DUE",
        "EACH",
        "EARLY",
        "EARTH",
        "EAST",
        "EASY",
        "EAT",
        "ECONOMY",
        "EDITION",
        "EDUCATION",
        "EFFORTS",
        "EGO",
        "EIGHT",
        "ELECTIONS",
        "ELECTRIC",
        "ELECTRICAL",
        "ELEPHANTS",
        "ELEVATOR",
        "ELSE",
        "EMAIL",
        "EMPIRE",
        "EMPLOYEE",
        "ENCOURAGEMENT",
        "END",
        "ENGINE",
        "ENJOY",
        "ENLARGED",
        "ENOUGH",
        "ENTIRE",
        "ENVIRONMENT",
        "EQUATION",
        "ETIQUETTE",
        "EVENING",
        "EVENTUALLY",
        "EVER",
        "EVERY",
        "EVERYBODY",
        "EVERYDAY",
        "EVERYONE",
        "EVERYWHERE",
        "EXAM",
        "EXAMPLE",
        "EXASPERATION",
        "EXCEED",
        "EXCELLENT",
        "EXCHANGE",
        "EXCITED",
        "EXCITING",
        "EXERCISE",
        "EXPECTANCY",
        "EXPENSES",
        "EXPENSIVE",
        "EXPLOSION",
        "EXPRESS",
        "EXTINCT",
        "EXTRA",
        "FACTS",
        "FAILURE",
        "FALLING",
        "FANS",
        "FAST",
        "FASTER",
        "FAVORITE",
        "FAX",
        "FEBRUARY",
        "FEEL",
        "FEELING",
        "FELL",
        "FEW",
        "FIELD",
        "FIGURE",
        "FIND",
        "FINE",
        "FINER",
        "FINGERS",
        "FIRE",
        "FIRST",
        "FISH",
        "FIT",
        "FIVE",
        "FLASHING",
        "FLAT",
        "FLAVORED",
        "FLYING",
        "FOG",
        "FOLDS",
        "FOLLOW",
        "FOOD",
        "FOOTBALL",
        "FOR",
        "FORCE",
        "FOREST",
        "FOREVER",
        "FORWARD",
        "FOUND",
        "FOUR",
        "FOURTH",
        "FOX",
        "FREE",
        "FREQUENTLY",
        "FREUD",
        "FRIEND",
        "FRIENDLY",
        "FROM",
        "FRONT",
        "FUDGE",
        "FUEL",
        "FULL",
        "FULLY",
        "FUN",
        "FUTILE",
        "GALLERY",
        "GAMBLERS",
        "GAME",
        "GAP",
        "GARBAGE",
        "GAS",
        "GEL",
        "GENERATION",
        "GET",
        "GETS",
        "GETTING",
        "GIVE",
        "GIVES",
        "GLANCE",
        "GLASSES",
        "GO",
        "GOES",
        "GOING",
        "GOLDILOCKS",
        "GOLFERS",
        "GOOD",
        "GOSPEL",
        "GOT",
        "GOVERNMENT",
        "GOVERNMENTS",
        "GRANITE",
        "GREASY",
        "GREAT",
        "GROCERY",
        "GROW",
        "GROWING",
        "GUIDELINES",
        "GUN",
        "HAD",
        "HAIR",
        "HAMBURGER",
        "HAND",
        "HANDICAPPED",
        "HANDLE",
        "HANDLED",
        "HANDS",
        "HARD",
        "HARDEST",
        "HAS",
        "HATE",
        "HAVE",
        "HAVING",
        "HE",
        "HEAD",
        "HEALTHY",
        "HEAR",
        "HEAT",
        "HECK",
        "HELP",
        "HELPS",
        "HER",
        "HERE",
        "HIGH",
        "HIGHER",
        "HIGHWAY",
        "HIM",
        "HIS",
        "HISTORIC",
        "HOLD",
        "HOLE",
        "HOME",
        "HONEST",
        "HOPES",
        "HORN",
        "HOUR",
        "HOURS",
        "HOUSE",
        "HOUSEKEEPER",
        "HOW",
        "I",
        "ICE",
        "IDEA",
        "IDES",
        "IDIOT",
        "IF",
        "IMAGINATION",
        "IMMEDIATELY",
        "IMPORTANT",
        "IN",
        "INCREASED",
        "INDEX",
        "INDICATION",
        "INEFFICIENT",
        "INFORMATION",
        "INJUSTICE",
        "INSPIRING",
        "INSULATION",
        "INSURANCE",
        "INTERACTIONS",
        "INTERESTING",
        "INTERFACE",
        "INVESTIGATE",
        "IRREGULAR",
        "IS",
        "IT",
        "JACKET",
        "JAMMED",
        "JEDI",
        "JEWELS",
        "JOB",
        "JOBS",
        "JOIN",
        "JOKE",
        "JONES",
        "JUDGES",
        "JUMPED",
        "JUMPING",
        "JUST",
        "JUSTICE",
        "KEEP",
        "KEEPS",
        "KIDS",
        "KILLER",
        "KING",
        "KISSING",
        "KNEE",
        "KNEES",
        "KNOCKING",
        "KNOW",
        "LABOUR",
        "LAGOON",
        "LAMB",
        "LAND",
        "LARGEST",
        "LASER",
        "LAST",
        "LATE",
        "LATER",
        "LAUGH",
        "LAUNDRY",
        "LAVATORY",
        "LEAP",
        "LEARN",
        "LEARNING",
        "LEATHER",
        "LEAVE",
        "LEAVING",
        "LEFT",
        "LENDER",
        "LENS",
        "LESSON",
        "LETTERS",
        "LEVEE",
        "LIAR",
        "LIBRARY",
        "LIE",
        "LIFE",
        "LIGHT",
        "LIKE",
        "LIMIT",
        "LIMITED",
        "LINE",
        "LISTEN",
        "LITTLE",
        "LIVING",
        "LOCATION",
        "LOCKED",
        "LONG",
        "LONGER",
        "LOOK",
        "LOOKS",
        "LOOSE",
        "LOOSES",
        "LOSERS",
        "LOT",
        "LOTTERY",
        "LOUDLY",
        "LOVE",
        "LOVELY",
        "LOW",
        "LUCKILY",
        "LUNCH",
        "LYDIA",
        "MACHINE",
        "MACHINERY",
        "MADE",
        "MAIL",
        "MAJESTY",
        "MAKE",
        "MAKEUP",
        "MAN",
        "MANY",
        "MARCH",
        "MARY",
        "MASK",
        "MATERNITY",
        "MAXIMUM",
        "ME",
        "MEANS",
        "MEDIEVAL",
        "MEET",
        "MEETING",
        "MEN",
        "MERGER",
        "MET",
        "METER",
        "MICROSCOPES",
        "MIDNIGHT",
        "MIGHT",
        "MIGHTIER",
        "MIND",
        "MINE",
        "MINIMUM",
        "MINUTE",
        "MISSED",
        "MISSION",
        "MIX",
        "MODERATION",
        "MOM",
        "MONITORED",
        "MONKEY",
        "MONTHLY",
        "MONTHS",
        "MORE",
        "MOST",
        "MOTHER",
        "MOTIVATIONAL",
        "MOVIE",
        "MUCH",
        "MURDER",
        "MUST",
        "MY",
        "MYSTERY",
        "NASTY",
        "NATION",
        "NATIONS",
        "NEAR",
        "NEARBY",
        "NEED",
        "NEEDED",
        "NEEDS",
        "NEITHER",
        "NERVOUS",
        "NEVER",
        "NEW",
        "NEWS",
        "NICE",
        "NIGHT",
        "NO",
        "NOBODY",
        "NON",
        "NOR",
        "NOSE",
        "NOT",
        "NOTHING",
        "NUMBER",
        "NUTTY",
        "OBEY",
        "OBJECTIVE",
        "OBJECTS",
        "OBLIGATIONS",
        "OBSERVATION",
        "OCCASIONAL",
        "OCCUR",
        "OCEANS",
        "OF",
        "OFF",
        "OFFENDERS",
        "OFFENDS",
        "OFFENSIVE",
        "OFFER",
        "OIL",
        "OK",
        "OLD",
        "OLYMPIC",
        "ON",
        "ONE",
        "ONLY",
        "OPERA",
        "OR",
        "ORDER",
        "ORDERED",
        "ORGANIZATION",
        "ORGANIZE",
        "OUR",
        "OUT",
        "OVER",
        "OVERDRAWN",
        "OWNED",
        "PAID",
        "PAINTINGS",
        "PARK",
        "PARKING",
        "PARKWAYS",
        "PARTIES",
        "PARTS",
        "PARTY",
        "PATIO",
        "PAY",
        "PEANUTS",
        "PEEK",
        "PEERING",
        "PEN",
        "PENALTY",
        "PEOPLE",
        "PERIOD",
        "PERSISTENT",
        "PERSON",
        "PERSONAL",
        "PERSONS",
        "PHENOMENON",
        "PHOTOGRAPHS",
        "PHRASES",
        "PHYSICS",
        "PICKET",
        "PICTURE",
        "PIES",
        "PIG",
        "PILE",
        "PIMP",
        "PLACE",
        "PLAY",
        "PLAYED",
        "PLAYERS",
        "PLAYING",
        "PLEASANT",
        "PLEASE",
        "PLUG",
        "POISONOUS",
        "POLITICAL",
        "POLITICS",
        "POOREST",
        "POPULARITY",
        "POPULATION",
        "POSTAL",
        "POWDER",
        "POWER",
        "PRAYER",
        "PRECAUTIONS",
        "PREDICTABLE",
        "PREFER",
        "PREFERRED",
        "PREPARE",
        "PRESCRIPTION",
        "PRESENCE",
        "PRESENTATION",
        "PREVAILING",
        "PRICE",
        "PRINTER",
        "PRIORITIES",
        "PRIORITY",
        "PRISON",
        "PRIZE",
        "PROBLEM",
        "PROBLEMS",
        "PROFESSOR",
        "PROFIT",
        "PROPRIETOR",
        "PROTECT",
        "PROTESTERS",
        "PROVIDE",
        "PROVIDED",
        "PROVINCES",
        "PSYCHIATRIST",
        "PSYCHOLOGY",
        "PUBLIC",
        "PUBLISHED",
        "PUMPING",
        "PUNISHMENT",
        "PUT",
        "QUACKS",
        "QUAKES",
        "QUESTION",
        "QUESTIONS",
        "QUICKLY",
        "QUIT",
        "QUITE",
        "QUOTA",
        "RACE",
        "RACKETBALL",
        "RAGED",
        "RAIN",
        "RAINDROPS",
        "RAISE",
        "RAPIDLY",
        "RATIONALE",
        "RATTLE",
        "REACH",
        "READING",
        "REALLY",
        "RECEIPTS",
        "RECRUITMENT",
        "RECTANGULAR",
        "RECYCLING",
        "RED",
        "REDOUBLE",
        "REDRESS",
        "REFERENDUM",
        "REFUSE",
        "REGISTERED",
        "REGISTRATION",
        "REJECTION",
        "RELATIONS",
        "RELIGION",
        "RELUCTANT",
        "RENT",
        "REQUIRE",
        "REQUIRES",
        "RESPONSE",
        "RESTAURANT",
        "RESULT",
        "RESULTS",
        "RETURN",
        "RICH",
        "RID",
        "RIFE",
        "RIGHT",
        "RINGS",
        "RISES",
        "RISK",
        "ROADS",
        "ROBIN",
        "ROCKS",
        "ROMAN",
        "ROUND",
        "ROVER",
        "RULES",
        "RUN",
        "RUNNING",
        "RUNS",
        "SAD",
        "SADDLES",
        "SAFE",
        "SAFETY",
        "SALESMEN",
        "SAM",
        "SAMPLE",
        "SANTA",
        "SATURDAY",
        "SATURN",
        "SAVING",
        "SAY",
        "SAYS",
        "SCENE",
        "SCHEDULING",
        "SCHOOLS",
        "SCRATCH",
        "SEASON",
        "SEASONED",
        "SEASONS",
        "SEAT",
        "SECOND",
        "SECURITY",
        "SEEMS",
        "SEEN",
        "SEES",
        "SEMINARS",
        "SENDS",
        "SENT",
        "SENTENCE",
        "SERVICE",
        "SERVICES",
        "SEVEN",
        "SHACK",
        "SHALL",
        "SHE",
        "SHEDS",
        "SHIP",
        "SHIRTS",
        "SHIVERING",
        "SHOP",
        "SHOPPING",
        "SHORT",
        "SHOULD",
        "SHOULDERS",
        "SHOUTING",
        "SHRINE",
        "SICK",
        "SIDES",
        "SILLY",
        "SILVER",
        "SING",
        "SISTER",
        "SIT",
        "SIX",
        "SIZE",
        "SKATE",
        "SKIMMED",
        "SLIPPERY",
        "SLOW",
        "SMALL",
        "SMART",
        "SNAKE",
        "SNOW",
        "SO",
        "SOCKET",
        "SOLD",
        "SOME",
        "SOMEONE",
        "SONS",
        "SOON",
        "SOUND",
        "SOUNDS",
        "SPACE",
        "SPAGHETTI",
        "SPEAK",
        "SPECTACULAR",
        "SPEECH",
        "SPEED",
        "SPEEDING",
        "SPILL",
        "SPILLED",
        "SPOONFUL",
        "SPORT",
        "SPOT",
        "SPRAWLING",
        "SQUANDER",
        "STABILITY",
        "STAGE",
        "STARLIGHT",
        "STATEMENT",
        "STAY",
        "STAYING",
        "STEEP",
        "STEP",
        "STICKER",
        "STIFF",
        "STILL",
        "STIMULUS",
        "STOCK",
        "STOP",
        "STORE",
        "STRAINED",
        "STRANGERS",
        "STREETS",
        "STUCK",
        "STUPID",
        "STYLE",
        "SUBDIVISIONS",
        "SUBJECT",
        "SUBJECTS",
        "SUBTRACTION",
        "SUBURBS",
        "SUCCEED",
        "SUCKER",
        "SUGGESTS",
        "SUITE",
        "SUM",
        "SUMMIT",
        "SUN",
        "SUNDAY",
        "SUNNY",
        "SUNSET",
        "SUPER",
        "SUPERMAN",
        "SURE",
        "SURGERY",
        "SWAMP",
        "SWEATSHIRT",
        "SWIM",
        "SWORD",
        "SYLLABUS",
        "SYMPATHY",
        "SYSTEM",
        "TABLETOP",
        "TAKE",
        "TAKES",
        "TAKING",
        "TALKING",
        "TAPE",
        "TASTE",
        "TAXATION",
        "TEACHING",
        "TEAM",
        "TELL",
        "TEMPERAMENT",
        "TENNIS",
        "TESTS",
        "THAN",
        "THANK",
        "THAT",
        "THE",
        "THEIR",
        "THERE",
        "THESE",
        "THEY",
        "THIGH",
        "THIN",
        "THING",
        "THINGS",
        "THINK",
        "THINKING",
        "THIS",
        "THOROUGH",
        "THOROUGHLY",
        "THOSE",
        "THOUSAND",
        "THREE",
        "THROUGH",
        "TICKETS",
        "TIE",
        "TIME",
        "TIMES",
        "TIRE",
        "TO",
        "TODAY",
        "TOES",
        "TOGETHER",
        "TOIL",
        "TOMORROW",
        "TONIGHT",
        "TOO",
        "TOOK",
        "TOP",
        "TOSS",
        "TOUCHDOWN",
        "TOWER",
        "TRADITIONAL",
        "TRAFFIC",
        "TRAIN",
        "TRAINS",
        "TRANSACTION",
        "TRANSIT",
        "TRAVEL",
        "TRAVELING",
        "TREASURE",
        "TREASURY",
        "TREAT",
        "TREE",
        "TRIED",
        "TRIPLE",
        "TROUBLE",
        "TRUCKS",
        "TRY",
        "TUMOR",
        "TURFED",
        "TURN",
        "TURTLENECK",
        "TWO",
        "UNACCEPTABLE",
        "UNAVAILABLE",
        "UNDERSTOOD",
        "UNDERWENT",
        "UNFORTUNATE",
        "UNICYCLE",
        "UNION",
        "UNIONS",
        "UNIVERSALLY",
        "UNIVERSITIES",
        "UNTIL",
        "US",
        "USE",
        "USER",
        "USUALLY",
        "VALID",
        "VALIDATED",
        "VALIUM",
        "VANILLA",
        "VENTILATION",
        "VERBS",
        "VERY",
        "VICTIMS",
        "VIDEO",
        "VISIT",
        "VISITED",
        "VOICE",
        "VOTE",
        "VOTERS",
        "WALK",
        "WALLET",
        "WANT",
        "WANTS",
        "WAR",
        "WARM",
        "WARRANTY",
        "WATCH",
        "WATCHED",
        "WATER",
        "WAVES",
        "WAY",
        "WE",
        "WEAR",
        "WEARING",
        "WEARS",
        "WEB",
        "WEEK",
        "WEEKEND",
        "WEEKENDS",
        "WEEPING",
        "WELL",
        "WENT",
        "WERE",
        "WHAT",
        "WHEN",
        "WHERE",
        "WHILE",
        "WHOLE",
        "WHY",
        "WIDER",
        "WILL",
        "WILLOWS",
        "WIN",
        "WIND",
        "WINDOW",
        "WINDY",
        "WINNER",
        "WINNERS",
        "WINTER",
        "WISDOM",
        "WISHFUL",
        "WITH",
        "WITHDRAWAL",
        "WITHOUT",
        "WITNESSES",
        "WOMEN",
        "WONDERFUL",
        "WORDS",
        "WORE",
        "WORK",
        "WORKING",
        "WORLD",
        "WORM",
        "WORRY",
        "WORTH",
        "WOULD",
        "WRITING",
        "WRONG",
        "WROTE",
        "YAP",
        "YARD",
        "YEAR",
        "YEARS",
        "YET",
        "YOU",
        "YOUNG",
        "YOUR",
        "ZERO",
        "ZOOM"
      ]
    }
  },
  "P3MS_subj12to4_seed1": {
    "protocol": "P3MS",
    "seed": 1,
    "snapshot_date": "2026-02-26",
    "split_id": "P3MS_subj12to4_seed1",
    "split_npz": "/mnt/share_gpu/naokkimu/epg_speller_for_icassp_camera_ready/raw_dataset/protocolSxms_split_seed1_subj12to4_ds1.npz",
    "subject": "subj12to4",
    "vocab": {
      "competition": [
        "ACCIDENT",
        "AGES",
        "BIRD",
        "BROKE",
        "CAMPING",
        "CARE",
        "CITY",
        "CONTEST",
        "DEPARTMENT",
        "ECONOMY",
        "EFFORT",
        "EGO",
        "FRIENDLY",
        "GEL",
        "GOVERNMENT",
        "IS",
        "LAUGH",
        "LEFT",
        "MADE",
        "MERGER",
        "MONTH",
        "NEAR",
        "OBSERVATION",
        "OFF",
        "PEANUTS",
        "PROFESSOR",
        "PROFIT",
        "PSYCHOLOGY",
        "PUMPING",
        "RACKETBALL",
        "RATIONALE",
        "REDRESS",
        "REGISTERED",
        "RESULTS",
        "ROBIN",
        "RULES",
        "SECURITY",
        "SHRINE",
        "SOME",
        "SPEAK",
        "STORE",
        "SUBJECT",
        "THOROUGHLY",
        "THREE",
        "TREASURER",
        "USE",
        "VOICE",
        "WAVES",
        "WELL",
        "WRITING"
      ],
      "test": [
        "A",
        "ABANDONED",
        "ABOARD",
        "ABOUT",
        "ACCEPT",
        "ACCEPTANCE",
        "ACCIDENT",
        "ACCOMPANIED",
        "ACCORDING",
        "ACCOUNT",
        "ACUTELY",
        "ADDITION",
        "ADULT",
        "ADVANCE",
        "AFRAID",
        "AFTER",
        "AGAIN",
        "AGES",
        "AGREE",
        "AGREEMENT",
        "AHEAD",
        "AIRPORT",
        "ALGORITHM",
        "ALL",
        "ALLERGIC",
        "ALLIGATOR",
        "ALLOTTED",
        "ALMOST",
        "ALWAYS",
        "AM",
        "AMAZING",
        "AMOUNT",
        "AN",
        "AND",
        "ANIMAL",
        "ANNIVERSARY",
        "ANNOUNCE",
        "ANSWERED",
        "ANY",
        "ANYMORE",
        "ANYTHING",
        "APARTMENTS",
        "APPEARS",
        "APPLE",
        "APPOINTMENT",
        "ARE",
        "ARGUING",
        "AROUND",
        "AS",
        "ASK",
        "ASKED",
        "ASPIRATIONS",
        "ASSAULT",
        "ASSIGNMENT",
        "ASTONISHMENT",
        "AT",
        "ATE",
        "ATHLETES",
        "AVOIDED",
        "AWARE",
        "AWAY",
        "BACK",
        "BAD",
        "BAKING",
        "BALANCE",
        "BALL",
        "BALONEY",
        "BANK",
        "BARE",
        "BAROQUE",
        "BARRACKS",
        "BASES",
        "BATH",
        "BATHROOM",
        "BATMAN",
        "BATTLES",
        "BE",
        "BEARS",
        "BEAUTIFUL",
        "BEEN",
        "BEER",
        "BEES",
        "BEFORE",
        "BEGINNING",
        "BEHIND",
        "BELIEVE",
        "BENIGN",
        "BEST",
        "BETTER",
        "BETWEEN",
        "BEWARE",
        "BIG",
        "BIGGEST",
        "BIKE",
        "BILL",
        "BILLS",
        "BIRD",
        "BIRTH",
        "BIRTHDAY",
        "BITE",
        "BITES",
        "BLAST",
        "BLAZED",
        "BLAZING",
        "BLOCKED",
        "BLOODSHED",
        "BLOW",
        "BLUES",
        "BONE",
        "BOOKS",
        "BORING",
        "BORROWER",
        "BOSS",
        "BOYS",
        "BREAK",
        "BREAKS",
        "BREATHING",
        "BRING",
        "BROKE",
        "BROKEN",
        "BROWN",
        "BROWSER",
        "BUCKLE",
        "BULLET",
        "BURGLARS",
        "BURIED",
        "BUS",
        "BUSINESS",
        "BUSY",
        "BUT",
        "BY",
        "BYPASS",
        "CAKE",
        "CALL",
        "CALLED",
        "CAMERA",
        "CAMPING",
        "CAN",
        "CANADA",
        "CANCER",
        "CANNOT",
        "CAPE",
        "CAPITAL",
        "CAPITALIST",
        "CAR",
        "CARD",
        "CARDS",
        "CARE",
        "CARELESS",
        "CARES",
        "CARPET",
        "CARS",
        "CAT",
        "CELLS",
        "CENTURY",
        "CHALLENGED",
        "CHAMBER",
        "CHANCELLOR",
        "CHANGED",
        "CHECKS",
        "CHEESE",
        "CHEMICAL",
        "CHEMISTRY",
        "CHEVY",
        "CHILD",
        "CHILDREN",
        "CHILLS",
        "CHLORINE",
        "CHOCOLATE",
        "CIRCUMSTANCES",
        "CITY",
        "CLASSICAL",
        "CLAUS",
        "CLOSE",
        "CLOSED",
        "COALITION",
        "COFFEE",
        "COLD",
        "COLLAPSE",
        "COME",
        "COMING",
        "COMMENT",
        "COMMITTED",
        "COMMUNICATE",
        "COMPANIES",
        "COMPLAINTS",
        "COMPLETE",
        "COMPLETELY",
        "COMPLICATED",
        "CONCENTRATE",
        "CONFERENCES",
        "CONFIDENTIAL",
        "CONNECTED",
        "CONSCIENCE",
        "CONSEQUENCES",
        "CONSIDERATION",
        "CONSTRUCTION",
        "CONTEST",
        "CONTRAST",
        "COOKIES",
        "COOLED",
        "CORONATION",
        "CORRECT",
        "CORRECTION",
        "COTTAGE",
        "COTTON",
        "COUNTRY",
        "COUPON",
        "COURSE",
        "COURT",
        "COURTS",
        "COVER",
        "CREAM",
        "CRIME",
        "CROWDED",
        "CROWN",
        "CUPS",
        "CURVE",
        "CUSTODY",
        "CUT",
        "DAILY",
        "DARING",
        "DASHING",
        "DATE",
        "DAUGHTERS",
        "DAY",
        "DECISION",
        "DECISIONS",
        "DEED",
        "DELIVERY",
        "DENIAL",
        "DEPARTMENT",
        "DEPOT",
        "DESERVE",
        "DESERVES",
        "DESIRED",
        "DESTRUCTION",
        "DETAILS",
        "DETECTOR",
        "DEWDROP",
        "DICTION",
        "DID",
        "DIFFICULT",
        "DINE",
        "DINOSAURS",
        "DIPLOMACY",
        "DIPPED",
        "DIRECTION",
        "DISASTER",
        "DISCHARGED",
        "DISCOURAGING",
        "DISCOVERING",
        "DISCREET",
        "DISGUSTING",
        "DISTURBANCE",
        "DO",
        "DOCTOR",
        "DOES",
        "DOG",
        "DOLPHINS",
        "DOOR",
        "DOORS",
        "DORMITORY",
        "DOUBLE",
        "DOW",
        "DOWN",
        "DREAM",
        "DREAMERS",
        "DREAMS",
        "DRESS",
        "DRINK",
        "DRIVE",
        "DRIVERS",
        "DRIVEWAYS",
        "DRIVING",
        "DROVE",
        "DRUGS",
        "DRY",
        "DUCK",
        "DUE",
        "EACH",
        "EARLY",
        "EARTH",
        "EAST",
        "EASY",
        "EAT",
        "ECONOMY",
        "EDITION",
        "EDUCATION",
        "EFFORT",
        "EFFORTS",
        "EGO",
        "EIGHT",
        "ELECTIONS",
        "ELECTRIC",
        "ELECTRICAL",
        "ELEPHANTS",
        "ELEVATOR",
        "ELSE",
        "EMAIL",
        "EMPIRE",
        "EMPLOYEE",
        "ENCOURAGEMENT",
        "END",
        "ENGINE",
        "ENJOY",
        "ENLARGED",
        "ENOUGH",
        "ENTER",
        "ENTIRE",
        "ENVIRONMENT",
        "EQUATION",
        "ETIQUETTE",
        "EVENING",
        "EVENTUALLY",
        "EVER",
        "EVERY",
        "EVERYBODY",
        "EVERYDAY",
        "EVERYONE",
        "EVERYWHERE",
        "EXAM",
        "EXAMPLE",
        "EXASPERATION",
        "EXCEED",
        "EXCELLENT",
        "EXCHANGE",
        "EXCITED",
        "EXCITING",
        "EXERCISE",
        "EXPECTANCY",
        "EXPENSES",
        "EXPENSIVE",
        "EXPERIENCE",
        "EXPLOSION",
        "EXPRESS",
        "EXTINCT",
        "EXTRA",
        "FACE",
        "FACTS",
        "FAILURE",
        "FALL",
